# # for-in循环：
"""
in表达从可迭代对象（字符串、序列）等中依次取值，又称为遍历
for-in的遍历对象必须为可迭代对象
"""
# for-in的语法结构：
"""
for 自定义的变量 in 可迭代对象：    (在可迭代对象中依次取出一个值 赋值给 自定义变量)
    循环体
"""
# 循环体内不需要访问自定义变量，可以将自定义变量替代为下划线
for item in 'python':  # 字符串
    print(item)  # 依次输出p y t h o n
print('\t')
""" """ """ """ """ """ """ """  """ """ """ """ """ """ """ """
r = range(10)  # 序列
for i in r:
    print(i)  # 输出0-9
print('\t')
""" """ """ """ """ """ """ """  """ """ """ """ """ """ """ """
# 若不需要使用自定义变量则使用“_”代替
for _ in range(5):
    print('for')  # 执行5次
